W7D1/app/models/user.rb

    def self.find_by_credentials(user_name, password)
        user = User.find_by(user_name: user_name)
---
SELECT  "users".* FROM "users" WHERE "users"."user_name" IS NULL LIMIT $1  [["LIMIT", 1]]